Examinator/src/InformationRegisters/ОтборыДанныхВебКабинетаСУО_О/ОтборыДанныхВебКабинетаСУО_О.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтборыДанныхВебКабинетаСУО_О</name>
  <attributes>
    <name>ОтборСсылка</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Отбор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтборыДанныхВебКабинетаСУО_О/ManagerModule.bsl
Процедура ДобавитьОтбор(Объект, Отбор) Экспорт
	
	ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Отбор = ИдентификаторОтбора;
	НоваяЗапись.Объект = Объект;
	НоваяЗапись.ОтборСсылка = Отбор;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();

	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УдалитьОтбор(Объект, Отбор = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ОтборыДанныхВебКабинетаСУО_О.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Объект.Установить(Объект);
	
	Если Отбор <> Неопределено Тогда
		ИдентификаторОтбора = Перечисления.ОтборыДанныхВебКабинетаСУО.Идентификатор(Отбор);
		НаборЗаписей.Отбор.Отбор.Установить(ИдентификаторОтбора);
	КонецЕсли;	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
